#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo/rds_migrations]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/demo/minimal_lambda_function]
module.buckets.aws_s3_bucket_object.db_sample_function_object: Refreshing state... [id=lambdas/demo/dbSampleHandler.zip]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=lambdas/demo/helloWorldHandler.zip]
module.functions.aws_lambda_function.db_sample_lambda_function: Refreshing state... [id=demo_db_sample_lambda_function]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=demo_minimal_lambda_function]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=9mwrfv]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-kb7gblbu69-9mwrfv-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-kb7gblbu69-9mwrfv-GET]
module.network.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=6sr9nd]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.db_sample_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "db_sample_function_object" {
      ~ etag               = "4178c277d852b402d97228ed0b1e171a" -> "9f5b562e225d0716d12997b029a29ce2"
        id                 = "lambdas/demo/dbSampleHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "b7b227b9d17226c77ac1817c3b4caaf0" -> "94e66ab6eccc4402df76bb4ff2878bfc"
        id                 = "lambdas/demo/helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.db_sample_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "db_sample_lambda_function" {
        id                             = "demo_db_sample_lambda_function"
      ~ last_modified                  = "2021-10-18T16:34:13.839+0000" -> (known after apply)
      ~ source_code_hash               = "C134XYR3GPgfpyx2qh33wTc6XBDbtpnqtSP1dN0Ke2Y=" -> "n0uLIQh3z0gWTWwGV3EuYWfvOAoonyM/N83NmjS1Mkw="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "demo_minimal_lambda_function"
      ~ last_modified                  = "2021-10-18T16:34:13.833+0000" -> (known after apply)
      ~ source_code_hash               = "FdNgYtvyN22HZg/GEOBV9YMJ4gtAnEUrpUodBP1/Dxs=" -> "CgpZyEbIPHh4g7Ze7tREO1F7wo+YYAPpbIofTFmDvcE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.network.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2021-10-18T16:34:13Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "6sr9nd" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2021-10-18T16:34:12Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*